#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_sqs_queue.csv_object_created will be created
  + resource "aws_sqs_queue" "csv_object_created" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "csv-object-created"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment"          = "prod"
          + "Product"              = "publish-power-consumption-to-ha"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/publish-power-consumption-to-ha"
        }
      + tags_all                          = {
          + "Environment"          = "prod"
          + "Product"              = "publish-power-consumption-to-ha"
          + "Terraform"            = "true"
          + "Terraform Repository" = "github.com/aribasadme/publish-power-consumption-to-ha"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: ./terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "./terraform.plan"

```

</details>

*Pushed by: @aribasadme, Action: `pull_request`*